{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"batch_input_shape": [null, 80, 160, 3], "epsilon": 0.001, "axis": -1, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "mode": 2, "name": "batchnormalization_1", "input_dtype": "float32", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 80, 160, 3], "nb_filter": 24, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_col": 5, "border_mode": "valid", "b_constraint": null, "activation": "linear", "nb_row": 5, "W_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "input_dtype": "float32", "name": "convolution2d_1", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "same", "strides": [1, 1], "name": "maxpooling2d_1", "pool_size": [5, 5]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_col": 5, "border_mode": "valid", "b_constraint": null, "activation": "linear", "nb_row": 5, "W_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "name": "convolution2d_2", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "same", "strides": [1, 1], "name": "maxpooling2d_2", "pool_size": [5, 5]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_col": 5, "border_mode": "valid", "b_constraint": null, "activation": "linear", "nb_row": 5, "W_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "name": "convolution2d_3", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "same", "strides": [1, 1], "name": "maxpooling2d_3", "pool_size": [5, 5]}}, {"class_name": "Dropout", "config": {"p": 0.05, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_col": 3, "border_mode": "valid", "b_constraint": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "convolution2d_4", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "same", "strides": [1, 1], "name": "maxpooling2d_4", "pool_size": [3, 3]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_col": 3, "border_mode": "valid", "b_constraint": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "name": "convolution2d_5", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "same", "strides": [1, 1], "name": "maxpooling2d_5", "pool_size": [3, 3]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "activation": "relu", "W_constraint": null, "activity_regularizer": null, "name": "dense_1", "output_dim": 100, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"input_dim": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "activation": "relu", "W_constraint": null, "activity_regularizer": null, "name": "dense_2", "output_dim": 50, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"p": 0.05, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"input_dim": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "activation": "relu", "W_constraint": null, "activity_regularizer": null, "name": "dense_3", "output_dim": 10, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"input_dim": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "name": "dense_4", "output_dim": 1, "init": "glorot_uniform"}}]}